export enum SocketEnum {
    Normal_Closure = 1000,
    Connection_Timeout = 4000,
    Poor_Network = 4001,
    Not_Network = 4002
}

export const errMsg = {
    0: "苹果系统自动断开连接",
 4000: "消息请求超时, 关闭连接",
 4001: "网络环境太差，无法连接",
 4002: "无网络环境，连接错误",
 1000: "正常关闭连接",
 1001: "终端离开，可能因为服务端错误，也可能因为游戏正从打开连接的页面跳转离开",
 1002: "由于协议错误而中断连接",
 1003: "由于接收到拒绝的数据类型而断开连接（如仅接收文本数据的终端接收到一些数据数据）",
 1006: "连接发生非正常关闭",
 1007: "因为收到了格式不符的数据而断开连接（如文本消息中包含了非 UTF-8 数据）",
 1008: "由于收到不符合约定的数据而导致断开连接。这是一个通用状态码，用于不适合使用1003和1009状态码的场景",
 1009: "因为收到过大的数据帧而断开连接",
 1010: "客户端请求服务器商定一个或多个，但服务器没有处理，因此客户端断开连接",
 1011: "客户端由于没有预期的情况阻止了其请求，因此服务端断开连接",
 1012: "由于重启而断开连接",
 1013: "由于临时原因导致连接断开，如超时因此断开连接客户端连接",
 1015: "表示连接由于无法完成 TLS 握手失败而关闭（例如无法验证服务器证书）"
}

export enum ProtocolType {
    JSON = "json",
    ARRAY_BUFFER = "arraybuffer"
}